app/controllers/articles_controller.rb

  def show
    @article = Article.find(params[:id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)

  def edit
    @article = Article.find(params[:id])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)

  def create
    author=User.find(session[:user_id])
#    @article = Article.new(params[:article])
   @article=author.articles.build(params[:article])
    respond_to do |format|
      if @article.save
---
SELECT * FROM "users" WHERE ("users"."id" = 4)
INSERT INTO "articles" ("created_at", "title", "updated_at", "content") VALUES('2009-12-06 12:01:07', '关于JSF的一些思考', '2009-12-06 12:01:07', '<p>&nbsp;&nbsp;&nbsp;&nbsp;&nbsp; 用过一段时间的Woodstock,当时感觉有点爽，但后来对于组件的控制方面的不是很好，没有在毕业设计上使用. 对于JSF想到了一些缺点，在这里分析一下。只是浅薄见解，欢迎讨论</p>

  def update
    @article = Article.find(params[:id])
    respond_to do |format|
      if @article.update_attributes(params[:article])
---
SELECT * FROM "articles" WHERE ("articles"."id" = 3)
UPDATE "articles" SET "updated_at" = '2009-12-06 11:59:40', "content" = '<h1>Ruby</h1>

  def destroy
    @article = Article.find(params[:id])
    @article.destroy
---
SELECT * FROM "articles" WHERE ("articles"."id" = 1)
DELETE FROM "articles" WHERE "id" = 1

def toggle
  article=Article.find(params[:id])
  puts "-------------------toggleing"
  p article.state
  if article.state=="deactive" then
    article.update_attribute("state", "active")
---
SELECT * FROM "articles" WHERE ("articles"."id" = 3)
UPDATE "articles" SET "updated_at" = '2010-01-02 02:34:22', "state" = 'active' WHERE "id" = 3

def feed
  author_id=params[:id];
  @articles=Article.find_all_by_author_id(author_id,:order=>"created_at DESC",:limit=>10)
  @author=User.find(author_id)
---
SELECT * FROM "articles" WHERE ("articles"."author_id" = '1') ORDER BY created_at DESC LIMIT 1
SELECT * FROM "users" WHERE ("users"."id" = '--- :author_id