app/controllers/comments_controller.rb

INSERT INTO "comments" ("created_at", "title", "author_name", "updated_at", "article_id", "content") VALUES('2010-01-01 05:24:53', 'asdfasdf', NULL, '2010-01-01 05:24:53', 1, 'asdf')
SELECT * FROM "articles" WHERE ("articles"."id" = 1)
SELECT * FROM "comments" WHERE ("comments".article_id = 1)
---
  def create
    comment=Comment.new(params[:comment])
    if comment.save();
      render :partial=>"/comments/comment",:collection=>Article.find(comment.article_id).comments

DELETE FROM "comments" WHERE "id" = 12
SELECT * FROM "comments" WHERE ("comments"."id" = 12)
---
  def destroy
    Comment.find(params[:id]).destroy

SELECT * FROM "articles" WHERE ("articles"."id" = 3)
SELECT * FROM "comments" WHERE ("comments".article_id = 3)
---
  def list
    article_id=params[:id];
    render :partial=>"/comments/comment",:collection=>Article.find(article_id).comments