app/controllers/console_controller.rb

SELECT * FROM "articles"
---
  def index
    @articles = Article.all