app/controllers/console_controller.rb

  def index
    @articles = Article.find_all_by_author_id(session[:user_id])
---
SELECT * FROM "articles" WHERE ("articles"."author_id" = 4) LIMIT 1