app/controllers/users_controller.rb

  def home
    begin
      if params[:username]
        @author=User.find_by_username(params[:username])
        @articles=Article.paginate_by_author_id @author.id,:page=>params[:page]||1,:per_page=>3,:order=>"created_at DESC"
        return
      elsif session[:user_id]
        @author=User.find(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."username" = 'users') LIMIT 1
SELECT * FROM "articles" WHERE ("articles"."author_id" = 1) ORDER BY created_at DESC LIMIT 3 OFFSET 0
SELECT * FROM "users" WHERE ("users"."id" = 4)

  def register
    if request.post?
      username,password=params[:user][:username],params[:user][:password];
      if User.find_by_username(username)
        puts
        redirect_to :back;
        flash[:notice]="user exists!"
        return
      end
      user=User.new(params[:user])
      if user.save
---
SELECT "users".id FROM "users" WHERE ("users"."username" = '1') LIMIT 1
INSERT INTO "users" ("created_at", "author_name", "updated_at", "username", "gender", "age", "password", "email") VALUES('2010-01-01 04:01:22', NULL, '2010-01-01 04:01:22', 'tsdeng', NULL, NULL, 'tsdeng', NULL)